w7d5_projects/reddit_clone/app/controllers/subs_controller.rb

    def create
        @sub = Sub.new(sub_params)
        @sub.moderator_id = params[:user_id]
        if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "doja-cat"], ["description", "all things doja"], ["moderator_id", 2], ["created_at", "2022-06-03 20:51:58.309182"], ["updated_at", "2022-06-03 20:51:58.309182"]]

    def update
        @sub = current_user.subs.find_by(title: params[:sub][:title])
        if @sub
            if @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."title" = $1 LIMIT $2  [["title", "doja-cat"], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "damn it i two suck"], ["updated_at", "2022-06-03 21:43:10.438014"], ["id", 4]]