w6d5_projects/ninety_nine_cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["name", "Green Dino000"], ["description", "            H's Cat\r\n        "], ["updated_at", "2022-05-27 23:40:53.148144"], ["id", 1]]
---
    def update
        @cat = Cat.find_by(id: params[:id])
        if @cat.update(cat_params)

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "cats" WHERE "cats"."id" = $1  [["id", 3]]
---
    def destroy
        @cat = Cat.find_by(id: params[:id])
        @cat.destroy